-- HUMAN RESOURCE MACHINE PROGRAM --
-- 13-Equalization-Room - SIZE 9/9 - SPEED 27/27 --

-- 要完成这个任务，操作逻辑是：
-- 每次从输入栏（INBOX）取**两个数**，对比它们：
-- - 如果两个数**相等**，就把其中一个放进输出栏（OUTBOX）；
-- - 如果两个数**不相等**，就“无视”这两个数（即不往输出栏放）。
-- 重复这个“取两个数→判断→处理”的步骤，直到输入栏的数被清空。
--
-- 另外，现在可以用 `...` 在代码的任何地方**随意添加注释**（用来解释代码，不影响实际运行）。
--
-- 举个简单例子：假设输入栏里的数是 `(10,10), (20,30), (5,5)`，处理过程是：
-- - 先取 `10` 和 `10`（相等），把其中一个 `10` 放进输出栏；
-- - 再取 `20` 和 `30`（不相等），无视，不放入输出栏；
-- - 最后取 `5` 和 `5`（相等），把其中一个 `5` 放进输出栏；
-- 直到输入栏清空，结束操作。


    JUMP     b
a:
    COPYFROM 0
    OUTBOX
b:
c:
    INBOX
    COPYTO   0
    INBOX
    SUB      0
    JUMPZ    a
    JUMP     c
